function volt_amper_char(
    I::Float64,
    G::Float64,
    d::Float64
)
    return 49022 * I ^ (-0.5) * G ^ (0.75) * d ^ (-0.5)
end

function diameter_fvach(
    U::Float64,
    I::Float64,
    G::Float64
)
    return ((49022 * G ^ (0.75))/(U * I ^ (0.5)))^2
end
# Исходные данные
p = 1e5
T = 5e3
P = 3e5
h = 6.877e7
ρ0 = 1.25

η1 = 0.85
P_plasm = P * η1
G = P_plasm/h
println("G (расчетный) = ", G)

U_source = 300
A_source = 0.9
U = A_source * U_source
I = P / U
println("I = ", I)

# Основные расчеты
d = diameter_fvach(U, I, G)
println("d (расчетный) = ", d)
d = 0.016  # фиксированное значение

w0 = 4*G/(ρ0 * π * d ^ 2)
E_cp = 281.8 * I * (I^2 / w0)^(-0.59) * (G / d)^(-0.53)
println("E_cp = ", E_cp)

ΔU_A = 17
ΔU_K = 25
L_СУД = (U - ΔU_A - ΔU_K) / E_cp
println("L_СУД = ", L_СУД)

# Расчеты электродов (первый вариант)
L_ЗШ = 2.5 * d
L_кнл = L_ЗШ - 0.5 * L_ЗШ
ΔL = d
L_анода = L_ЗШ + ΔL
println("L_анода (вар.1) = ", L_анода)

j_анода = I / (π * d * L_анода)
println("j_анода = ", j_анода)
j_катода = 1e8
d_катода = sqrt(4 * I / (π * j_катода))
println("d_катода (расчетный) = ", d_катода)
d_катода = 5e-3  # фиксированное значение
println("==========================================================")
# Расчеты с L_ФИК
L_ФИК = (U - ΔU_A - ΔU_K) / E_cp
println("L_ФИК = ", L_ФИК)
L_ФИК = 0.27  # фиксированное значение

L_УСТ = L_ФИК
println("L_УСТ = ", L_УСТ)

# Расчеты геометрии
d_анода = 1.5 * d
L_0 = (d_анода - d) / (2 * tan(0.226892803))  # угол 13° в радианах
L_анода = 2 * L_0 + ΔL
println("L_анода (вар.2) = ", L_анода)
L_анода = 0.04  # фиксированное значение

L_кнл = L_УСТ - L_0
println("L_кнл = ", L_кнл)
L_кнл = 0.25  # фиксированное значение
L_вых = L_кнл + L_анода

# Газодинамические характеристики
a = sqrt(1.4 * 8.31 * 5000/0.028)
w = 4*G/(0.07*π*d^2)
d_критическое = sqrt(4G/(0.07*π*a))
a_0 = sqrt(1.4 * 8.31 * 293/0.028)
F_отв = G/(ρ0*a_0)
d_отв = sqrt(4*F_отв/(3*π))
d_отв = 0.002

# Ресурс электродов
g_анода  = 1e-10
ρ_анода = 8960
δ_анода = 0.005
τ_анода = (ρ_анода * δ_анода) / (3600 * g_анода * 1.5 * j_анода)

g_катода  = 1e-12
ρ_катода = 19300
δ_катода = 0.005
τ_катода = (ρ_катода * δ_катода) / (3600 * g_катода * 1.5 * j_катода)
